# Pandas Data - Strings Manipulation

In [3]:
import pandas as pd

# Tasks

In [32]:
# Create a small sample DataFrame
data = {
    'StudentID': [1, 2, 3, 4, 5, 6],
    'Name': ['Mandal A Kumar', 'Suroor Ahmed', 'Amandeep Kaur', 'Nayeema', 'Muhammad H Kabeer', 'Bijata Marjan'],
    'Score': [85, 92, 78, 88, 91, 84]
}

df = pd.DataFrame(data)

In [33]:
df

   StudentID               Name  Score
0          1     Mandal A Kumar     85
1          2       Suroor Ahmed     92
2          3      Amandeep Kaur     78
3          4            Nayeema     88
4          5  Muhammad H Kabeer     91
5          6      Bijata Marjan     84

In [34]:
# Search for 'john' in Name column (case-insensitive)
search_term = 'Nayeema'
matches = df[df['Name'].str.contains(search_term, case=False, na=False)]

In [35]:
matches

   StudentID     Name  Score
3          4  Nayeema     88

In [36]:
df[df['Name'].str.startswith('M')]

   StudentID               Name  Score
0          1     Mandal A Kumar     85
4          5  Muhammad H Kabeer     91

In [37]:
startChar = ('M','A')  #tuple
df[df['Name'].str.startswith(startChar)]

   StudentID               Name  Score
0          1     Mandal A Kumar     85
2          3      Amandeep Kaur     78
4          5  Muhammad H Kabeer     91

In [38]:
df[df['Name'].str.contains(r'^(Man|Aman)', case=False, na=False)]

/var/folders/z4/8qd93wx14xz1c9qfb_z969wc0000gn/T/ipykernel_12566/3667526613.py:1: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  df[df['Name'].str.contains(r'^(Man|Aman)', case=False, na=False)]

   StudentID            Name  Score
0          1  Mandal A Kumar     85
2          3   Amandeep Kaur     78

In [39]:
words = ['Mu', 'Nay', 'Sur']
pattern = '^(' + '|'.join(words) + ')'
df[df['Name'].str.contains(pattern, case=False, na=False)]

/var/folders/z4/8qd93wx14xz1c9qfb_z969wc0000gn/T/ipykernel_12566/1767152750.py:3: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  df[df['Name'].str.contains(pattern, case=False, na=False)]

   StudentID               Name  Score
1          2       Suroor Ahmed     92
3          4            Nayeema     88
4          5  Muhammad H Kabeer     91

In [40]:
starts = tuple(words)
df[df['Name'].str.startswith(starts)]  #no warning

   StudentID               Name  Score
1          2       Suroor Ahmed     92
3          4            Nayeema     88
4          5  Muhammad H Kabeer     91

In [41]:
df

   StudentID               Name  Score
0          1     Mandal A Kumar     85
1          2       Suroor Ahmed     92
2          3      Amandeep Kaur     78
3          4            Nayeema     88
4          5  Muhammad H Kabeer     91
5          6      Bijata Marjan     84

In [42]:
df['Name'].apply(lambda x: re.sub(r'Suroor', 'SURUR', x))

0       Mandal A Kumar
1          SURUR Ahmed
2        Amandeep Kaur
3              Nayeema
4    Muhammad H Kabeer
5        Bijata Marjan
Name: Name, dtype: object

## Find & Replace Strings

In [27]:
import pandas as pd; import re

In [28]:
df = pd.DataFrame({'text_column': ['apple pie', 'banana bread', 'cherry tart']})
df

    text_column
0     apple pie
1  banana bread
2   cherry tart

In [29]:
# Find all occurrences of a pattern
df['found_matches'] = df['text_column'].apply(lambda x: re.findall(r'\b\w+a\w+\b', x))
df

    text_column    found_matches
0     apple pie               []
1  banana bread  [banana, bread]
2   cherry tart           [tart]

In [30]:
# Replace a pattern
df['replaced_text'] = df['text_column'].apply(lambda x: re.sub(r'apple', 'orange', x))

In [31]:
df

    text_column    found_matches replaced_text
0     apple pie               []    orange pie
1  banana bread  [banana, bread]  banana bread
2   cherry tart           [tart]   cherry tart

In [ ]:
df['text_column'].apply(lambda x: re.sub(r'apple', 'orange', x))